<a href="https://colab.research.google.com/github/Nik8x/Titanic-Prediction/blob/master/titanic_data_cleaning_in_detail.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# prediction
# 1. regression
# 2. classification

In [0]:
# continuous value or a quantitative value

In [0]:
# 456.78 or 1.234 or 56

In [0]:
# discrete or qualitative value

In [0]:
# yes no male female 1 0 survived not survived

In [0]:
float("23.4")

23.4

In [0]:
int("23")

23

In [0]:
int(float("25.678"))

25

In [0]:
"25.00"

'25.00'

In [0]:
neww = "eliza"

In [0]:
neww.encode("ascii")

b'eliza'

In [0]:
' '.join(format(ord(x), 'b') for x in neww)

'1100101 1101100 1101001 1111010 1100001'

In [0]:
import pandas as pd

In [0]:
titan = pd.read_csv("https://raw.githubusercontent.com/Nik8x/Titanic-Prediction/master/titanic3.csv")

In [0]:
titan.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [0]:
titan.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [0]:
titan[0:1]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"

In [0]:
ttn = {"pclass" : [1,0, 1],
      "name": ["nic", "ket", "ch"]}

In [0]:
ttn["pclass"]

[1, 0, 1]

In [0]:
titan[["pclass"]].head()

   pclass
0     1.0
1     1.0
2     1.0
3     1.0
4     1.0

In [0]:
ttn

{'name': ['nic', 'ket', 'ch'], 'pclass': [1, 0, 1]}

In [0]:
pd.DataFrame(ttn)

   pclass name
0       1  nic
1       0  ket
2       1   ch

In [0]:
ttna = {"pclass" : [1, 0, 1, 2],
      "name": ["nic", "ket", "ch"],
       "age" : [21, 34, 45]}

In [0]:
ttna

{'age': [21, 34, 45], 'name': ['nic', 'ket', 'ch'], 'pclass': [1, 0, 1, 2]}

In [0]:
ttna["pclass"]["name"]

TypeError: ignored

In [0]:
ttna["pclass", "name"]

KeyError: ignored

In [0]:
for i, j in ttna.items():
  print(i, j)

pclass [1, 0, 1, 2]
name ['nic', 'ket', 'ch']
age [21, 34, 45]

In [0]:
ttna.items()

dict_items([('pclass', [1, 0, 1, 2]), ('name', ['nic', 'ket', 'ch']), ('age', [21, 34, 45])])

In [0]:
print(ttna["pclass", "name"])

KeyError: ignored

In [0]:
for i in ["pclass", "name"]:
  print(ttna[i])

[1, 0, 1, 2]
['nic', 'ket', 'ch']

In [0]:
[ttna[i] for i in ["pclass", "name"]]

[[1, 0, 1, 2], ['nic', 'ket', 'ch']]

In [0]:
titan.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [0]:
for i in ["pclass", "name"]:
  print(titan[i].head())

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
Name: pclass, dtype: float64
0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Name: name, dtype: object

In [0]:
titan[["pclass", "name"]].head()

   pclass                                             name
0     1.0                    Allen, Miss. Elisabeth Walton
1     1.0                   Allison, Master. Hudson Trevor
2     1.0                     Allison, Miss. Helen Loraine
3     1.0             Allison, Mr. Hudson Joshua Creighton
4     1.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

In [0]:
for i in ["pclass", "name"]:
  print(titan[i].head())

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
Name: pclass, dtype: float64
0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Name: name, dtype: object

In [0]:
pd.DataFrame([[titan[i] for i in ["pclass"]][0], [titan[i] for i in ["name"]][0]]).T.head()

  pclass                                             name
0      1                    Allen, Miss. Elisabeth Walton
1      1                   Allison, Master. Hudson Trevor
2      1                     Allison, Miss. Helen Loraine
3      1             Allison, Mr. Hudson Joshua Creighton
4      1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

In [0]:
pd.DataFrame([[1,2,1,2]])

   0  1  2  3
0  1  2  1  2

In [0]:
titan.shape

(1310, 14)

In [0]:
len(titan)

1310

In [0]:
(1310, 14)[0]

1310

In [0]:
titan.shape[0], titan.shape[1]

(1310, 14)

In [0]:
biplob = len

In [0]:
biplob("happy")

5

In [0]:
titan[0:1]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"

In [0]:
titan.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [0]:
titan.columns[0:2]

Index(['pclass', 'survived'], dtype='object')

In [0]:
titan[[titan.columns[0], titan.columns[2]]].head()

   pclass                                             name
0     1.0                    Allen, Miss. Elisabeth Walton
1     1.0                   Allison, Master. Hudson Trevor
2     1.0                     Allison, Miss. Helen Loraine
3     1.0             Allison, Mr. Hudson Joshua Creighton
4     1.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

In [0]:
for i in [0, 2]:
  print(titan[[titan.columns[i]]].head())

   pclass
0     1.0
1     1.0
2     1.0
3     1.0
4     1.0
                                              name
0                    Allen, Miss. Elisabeth Walton
1                   Allison, Master. Hudson Trevor
2                     Allison, Miss. Helen Loraine
3             Allison, Mr. Hudson Joshua Creighton
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

In [0]:
titan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
pclass       1309 non-null float64
survived     1309 non-null float64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null float64
parch        1309 non-null float64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

In [0]:
titan.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [0]:
import numpy as np
np.nan

nan

In [0]:
x = np.nan
x

nan

In [0]:
x is np.nan

True

In [0]:
True + True + False + True

3

In [0]:
np.sum([1, 2, 3, 5])

11

In [0]:
titan.isnull().head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,False,False,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False,True,True,False
3,False,False,False,False,False,False,False,False,False,False,False,True,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,True,False

In [0]:
np.sum(titan[['pclass']].isnull())

pclass    1
dtype: int64

In [0]:
for i in titan.columns:
  print(np.sum(titan[[i]].isnull()))

pclass    1
dtype: int64
survived    1
dtype: int64
name    1
dtype: int64
sex    1
dtype: int64
age    264
dtype: int64
sibsp    1
dtype: int64
parch    1
dtype: int64
ticket    1
dtype: int64
fare    2
dtype: int64
cabin    1015
dtype: int64
embarked    3
dtype: int64
boat    824
dtype: int64
body    1189
dtype: int64
home.dest    565
dtype: int64

In [0]:
titan.isnull().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [0]:
titan.isnull().sum().sum()

3869

In [0]:
titan.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [0]:
titan.head(1309)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1.0,1.0,"Anderson, Mr. Harry",male,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1.0,0.0,"Andrews, Mr. Thomas Jr",male,39.0000,0.0,0.0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0000,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
10,1.0,0.0,"Astor, Col. John Jacob",male,47.0000,1.0,0.0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
11,1.0,1.0,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,1.0,0.0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
12,1.0,1.0,"Aubart, Mme. Leontine Pauline",female,24.0000,0.0,0.0,PC 17477,69.3000,B35,C,9,NaN,"Paris, France"
13,1.0,1.0,"Barber, Miss. Ellen ""Nellie""",female,26.0000,0.0,0.0,19877,78.8500,NaN,S,6,NaN,NaN
14,1.0,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0000,0.0,0.0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
15,1.0,0.0,"Baumann, Mr. John D",male,NaN,0.0,0.0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
16,1.0,0.0,"Baxter, Mr. Quigg Edmond",male,24.0000,0.0,1.0,PC 17558,247.5208,B58 B60,C,NaN,NaN,"Montreal, PQ"
17,1.0,1.0,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0000,0.0,1.0,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
18,1.0,1.0,"Bazzani, Miss. Albina",female,32.0000,0.0,0.0,11813,76.2917,D15,C,8,NaN,NaN
19,1.0,0.0,"Beattie, Mr. Thomson",male,36.0000,0.0,0.0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN"
20,1.0,1.0,"Beckwith, Mr. Richard Leonard",male,37.0000,1.0,1.0,11751,52.5542,D35,S,5,NaN,"New York, NY"
21,1.0,1.0,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0000,1.0,1.0,11751,52.5542,D35,S,5,NaN,"New York, NY"
22,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0000,0.0,0.0,111369,30.0000,C148,C,5,NaN,"New York, NY"
23,1.0,1.0,"Bidois, Miss. Rosalie",female,42.0000,0.0,0.0,PC 17757,227.5250,NaN,C,4,NaN,NaN
24,1.0,1.0,"Bird, Miss. Ellen",female,29.0000,0.0,0.0,PC 17483,221.7792,C97,S,8,NaN,NaN
25,1.0,0.0,"Birnbaum, Mr. Jakob",male,25.0000,0.0,0.0,13905,26.0000,NaN,C,NaN,148.0,"San Francisco, CA"
26,1.0,1.0,"Bishop, Mr. Dickinson H",male,25.0000,1.0,0.0,11967,91.0792,B49,C,7,NaN,"Dowagiac, MI"
27,1.0,1.0,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.0000,1.0,0.0,11967,91.0792,B49,C,7,NaN,"Dowagiac, MI"
28,1.0,1.0,"Bissette, Miss. Amelia",female,35.0000,0.0,0.0,PC 17760,135.6333,C99,S,8,NaN,NaN
29,1.0,1.0,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0000,0.0,0.0,110564,26.5500,C52,S,D,NaN,"Stockholm, Sweden / Washington, DC"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1279,3.0,0.0,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0000,0.0,0.0,350406,7.8542,NaN,S,NaN,NaN,NaN
1280,3.0,0.0,"Vovk, Mr. Janko",male,22.0000,0.0,0.0,349252,7.8958,NaN,S,NaN,NaN,NaN
1281,3.0,0.0,"Waelens, Mr. Achille",male,22.0000,0.0,0.0,345767,9.0000,NaN,S,NaN,NaN,"Antwerp, Belgium / Stanton, OH"
1282,3.0,0.0,"Ware, Mr. Frederick",male,NaN,0.0,0.0,359309,8.0500,NaN,S,NaN,NaN,NaN
1283,3.0,0.0,"Warren, Mr. Charles William",male,NaN,0.0,0.0,C.A. 49867,7.5500,NaN,S,NaN,NaN,NaN
1284,3.0,0.0,"Webber, Mr. James",male,NaN,0.0,0.0,SOTON/OQ 3101316,8.0500,NaN,S,NaN,NaN,NaN
1285,3.0,0.0,"Wenzel, Mr. Linhart",male,32.5000,0.0,0.0,345775,9.5000,NaN,S,NaN,298.0,NaN
1286,3.0,1.0,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0000,0.0,0.0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3.0,0.0,"Widegren, Mr. Carl/Charles Peter",male,51.0000,0.0,0.0,347064,7.7500,NaN,S,NaN,NaN,NaN
1288,3.0,0.0,"Wiklund, Mr. Jakob Alfred",male,18.0000,1.0,0.0,3101267,6.4958,NaN,S,NaN,314.0,NaN
1289,3.0,0.0,"Wiklund, Mr. Karl Johan",male,21.0000,1.0,0.0,3101266,6.4958,NaN,S,NaN,NaN,NaN
1290,3.0,1.0,"Wilkes, Mrs. James (Ellen Needs)",female,47.0000,1.0,0.0,363272,7.0000,NaN,S,NaN,NaN,NaN
1291,3.0,0.0,"Willer, Mr. Aaron (""Abi Weller"")",male,NaN,0.0,0.0,3410,8.7125,NaN,S,NaN,NaN,NaN
1292,3.0,0.0,"Willey, Mr. Edward",male,NaN,0.0,0.0,S.O./P.P. 751,7.5500,NaN,S,NaN,NaN,NaN
1293,3.0,0.0,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0.0,0.0,A/5 2466,8.0500,NaN,S,NaN,NaN,NaN
1294,3.0,0.0,"Williams, Mr. Leslie",male,28.5000,0.0,0.0,54636,16.1000,NaN,S,NaN,14.0,NaN
1295,3.0,0.0,"Windelov, Mr. Einar",male,21.0000,0.0,0.0,SOTON/OQ 3101317,7.2500,NaN,S,NaN,NaN,NaN
1296,3.0,0.0,"Wirz, Mr. Albert",male,27.0000,0.0,0.0,315154,8.6625,NaN,S,NaN,131.0,NaN
1297,3.0,0.0,"Wiseman, Mr. Phillippe",male,NaN,0.0,0.0,A/4. 34244,7.2500,NaN,S,NaN,NaN,NaN
1298,3.0,0.0,"Wittevrongel, Mr. Camille",male,36.0000,0.0,0.0,345771,9.5000,NaN,S,NaN,NaN,NaN
1299,3.0,0.0,"Yasbeck, Mr. Antoni",male,27.0000,1.0,0.0,2659,14.4542,NaN,C,C,NaN,NaN
1300,3.0,1.0,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0000,1.0,0.0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3.0,0.0,"Youseff, Mr. Gerious",male,45.5000,0.0,0.0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3.0,0.0,"Yousif, Mr. Wazli",male,NaN,0.0,0.0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3.0,0.0,"Yousseff, Mr. Gerious",male,NaN,0.0,0.0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3.0,0.0,"Zabour, Miss. Hileni",female,14.5000,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [0]:
titan[0:1309]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1.0,1.0,"Anderson, Mr. Harry",male,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1.0,0.0,"Andrews, Mr. Thomas Jr",male,39.0000,0.0,0.0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0000,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
10,1.0,0.0,"Astor, Col. John Jacob",male,47.0000,1.0,0.0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
11,1.0,1.0,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,1.0,0.0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
12,1.0,1.0,"Aubart, Mme. Leontine Pauline",female,24.0000,0.0,0.0,PC 17477,69.3000,B35,C,9,NaN,"Paris, France"
13,1.0,1.0,"Barber, Miss. Ellen ""Nellie""",female,26.0000,0.0,0.0,19877,78.8500,NaN,S,6,NaN,NaN
14,1.0,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0000,0.0,0.0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
15,1.0,0.0,"Baumann, Mr. John D",male,NaN,0.0,0.0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
16,1.0,0.0,"Baxter, Mr. Quigg Edmond",male,24.0000,0.0,1.0,PC 17558,247.5208,B58 B60,C,NaN,NaN,"Montreal, PQ"
17,1.0,1.0,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0000,0.0,1.0,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
18,1.0,1.0,"Bazzani, Miss. Albina",female,32.0000,0.0,0.0,11813,76.2917,D15,C,8,NaN,NaN
19,1.0,0.0,"Beattie, Mr. Thomson",male,36.0000,0.0,0.0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN"
20,1.0,1.0,"Beckwith, Mr. Richard Leonard",male,37.0000,1.0,1.0,11751,52.5542,D35,S,5,NaN,"New York, NY"
21,1.0,1.0,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0000,1.0,1.0,11751,52.5542,D35,S,5,NaN,"New York, NY"
22,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0000,0.0,0.0,111369,30.0000,C148,C,5,NaN,"New York, NY"
23,1.0,1.0,"Bidois, Miss. Rosalie",female,42.0000,0.0,0.0,PC 17757,227.5250,NaN,C,4,NaN,NaN
24,1.0,1.0,"Bird, Miss. Ellen",female,29.0000,0.0,0.0,PC 17483,221.7792,C97,S,8,NaN,NaN
25,1.0,0.0,"Birnbaum, Mr. Jakob",male,25.0000,0.0,0.0,13905,26.0000,NaN,C,NaN,148.0,"San Francisco, CA"
26,1.0,1.0,"Bishop, Mr. Dickinson H",male,25.0000,1.0,0.0,11967,91.0792,B49,C,7,NaN,"Dowagiac, MI"
27,1.0,1.0,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.0000,1.0,0.0,11967,91.0792,B49,C,7,NaN,"Dowagiac, MI"
28,1.0,1.0,"Bissette, Miss. Amelia",female,35.0000,0.0,0.0,PC 17760,135.6333,C99,S,8,NaN,NaN
29,1.0,1.0,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0000,0.0,0.0,110564,26.5500,C52,S,D,NaN,"Stockholm, Sweden / Washington, DC"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1279,3.0,0.0,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0000,0.0,0.0,350406,7.8542,NaN,S,NaN,NaN,NaN
1280,3.0,0.0,"Vovk, Mr. Janko",male,22.0000,0.0,0.0,349252,7.8958,NaN,S,NaN,NaN,NaN
1281,3.0,0.0,"Waelens, Mr. Achille",male,22.0000,0.0,0.0,345767,9.0000,NaN,S,NaN,NaN,"Antwerp, Belgium / Stanton, OH"
1282,3.0,0.0,"Ware, Mr. Frederick",male,NaN,0.0,0.0,359309,8.0500,NaN,S,NaN,NaN,NaN
1283,3.0,0.0,"Warren, Mr. Charles William",male,NaN,0.0,0.0,C.A. 49867,7.5500,NaN,S,NaN,NaN,NaN
1284,3.0,0.0,"Webber, Mr. James",male,NaN,0.0,0.0,SOTON/OQ 3101316,8.0500,NaN,S,NaN,NaN,NaN
1285,3.0,0.0,"Wenzel, Mr. Linhart",male,32.5000,0.0,0.0,345775,9.5000,NaN,S,NaN,298.0,NaN
1286,3.0,1.0,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0000,0.0,0.0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3.0,0.0,"Widegren, Mr. Carl/Charles Peter",male,51.0000,0.0,0.0,347064,7.7500,NaN,S,NaN,NaN,NaN
1288,3.0,0.0,"Wiklund, Mr. Jakob Alfred",male,18.0000,1.0,0.0,3101267,6.4958,NaN,S,NaN,314.0,NaN
1289,3.0,0.0,"Wiklund, Mr. Karl Johan",male,21.0000,1.0,0.0,3101266,6.4958,NaN,S,NaN,NaN,NaN
1290,3.0,1.0,"Wilkes, Mrs. James (Ellen Needs)",female,47.0000,1.0,0.0,363272,7.0000,NaN,S,NaN,NaN,NaN
1291,3.0,0.0,"Willer, Mr. Aaron (""Abi Weller"")",male,NaN,0.0,0.0,3410,8.7125,NaN,S,NaN,NaN,NaN
1292,3.0,0.0,"Willey, Mr. Edward",male,NaN,0.0,0.0,S.O./P.P. 751,7.5500,NaN,S,NaN,NaN,NaN
1293,3.0,0.0,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0.0,0.0,A/5 2466,8.0500,NaN,S,NaN,NaN,NaN
1294,3.0,0.0,"Williams, Mr. Leslie",male,28.5000,0.0,0.0,54636,16.1000,NaN,S,NaN,14.0,NaN
1295,3.0,0.0,"Windelov, Mr. Einar",male,21.0000,0.0,0.0,SOTON/OQ 3101317,7.2500,NaN,S,NaN,NaN,NaN
1296,3.0,0.0,"Wirz, Mr. Albert",male,27.0000,0.0,0.0,315154,8.6625,NaN,S,NaN,131.0,NaN
1297,3.0,0.0,"Wiseman, Mr. Phillippe",male,NaN,0.0,0.0,A/4. 34244,7.2500,NaN,S,NaN,NaN,NaN
1298,3.0,0.0,"Wittevrongel, Mr. Camille",male,36.0000,0.0,0.0,345771,9.5000,NaN,S,NaN,NaN,NaN
1299,3.0,0.0,"Yasbeck, Mr. Antoni",male,27.0000,1.0,0.0,2659,14.4542,NaN,C,C,NaN,NaN
1300,3.0,1.0,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0000,1.0,0.0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3.0,0.0,"Youseff, Mr. Gerious",male,45.5000,0.0,0.0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3.0,0.0,"Yousif, Mr. Wazli",male,NaN,0.0,0.0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3.0,0.0,"Yousseff, Mr. Gerious",male,NaN,0.0,0.0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3.0,0.0,"Zabour, Miss. Hileni",female,14.5000,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [0]:
titan = titan[0:-1]

In [0]:
titan.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [0]:
# titan[['pclass', 'survived',.......]]
listy = []
for i in [0, 1, 2, 3, 4, 5, 6, 7, 8, 10]:
  listy.append(titan[titan.columns[i]])
pd.DataFrame(listy).T.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.338,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,S
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,S

In [0]:
pd.DataFrame([titan[titan.columns[i]] for i in [0, 1, 2, 3, 4, 5, 6, 7, 8, 10]]).T.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.338,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,S
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,S

In [0]:
titan.drop(['cabin',	'boat',	'body',	'home.dest'], axis = 1).head() # here if we dont store it into a variable we can do hit and trial

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,S
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,S
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,S
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,S
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,S

In [0]:
for i in ['cabin',	'boat',	'body',	'home.dest']:
  del(titan[i]) # if we use del() it permanently deletes the column from original variable(dataframe)

In [0]:
titan.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,S
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,S
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,S
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,S
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,S

In [0]:
titan.isnull().sum()

pclass        0
survived      0
name          0
sex           0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [0]:
# best ways to deal with missing values in dataframes
# remove the missing values
# drop the missing rows
# drop the missing columns
# replace the missing value by 0
# replace the missing value by the average of that column
# replace the missing value by the most common occuring class/level in that column

In [0]:
titan['embarked'].dtype # the data type of this column is object, so we cannot fill the NaN values with 0.
# nor with average, but by the most common occuring class/level

dtype('O')

In [0]:
titan[0:10:2]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0,0.0,0.0,24160,211.3375,S
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0,1.0,2.0,113781,151.5500,S
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1.0,2.0,113781,151.5500,S
6,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",female,63.0,1.0,0.0,13502,77.9583,S
8,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2.0,0.0,11769,51.4792,S

In [0]:
# how can we look at the rows where embarked has NaN's
titan[titan['embarked'].isnull() == True]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
168,1.0,1.0,"Icard, Miss. Amelie",female,38.0,0.0,0.0,113572,80.0,NaN
284,1.0,1.0,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0.0,0.0,113572,80.0,NaN

In [0]:
# what should be the data which replaces NaN's in embarked

In [0]:
(titan["embarked"] == "S").sum()

914

In [0]:
(titan["embarked"] == "C").sum()

270

In [0]:
(titan["embarked"] == "Q").sum()

123

In [0]:
# figuring out how many classes/levels are there in embarked

In [0]:
import re

In [0]:
x = "".join(str(titan['embarked'][titan['embarked'] != np.nan]))
x

'0       S\n1       S\n2       S\n3       S\n4       S\n5       S\n6       S\n7       S\n8       S\n9       C\n10      C\n11      C\n12      C\n13      S\n14      S\n15      S\n16      C\n17      C\n18      C\n19      C\n20      S\n21      S\n22      C\n23      C\n24      S\n25      C\n26      C\n27      C\n28      S\n29      S\n       ..\n1279    S\n1280    S\n1281    S\n1282    S\n1283    S\n1284    S\n1285    S\n1286    C\n1287    S\n1288    S\n1289    S\n1290    S\n1291    S\n1292    S\n1293    S\n1294    S\n1295    S\n1296    S\n1297    S\n1298    S\n1299    C\n1300    C\n1301    C\n1302    C\n1303    C\n1304    C\n1305    C\n1306    C\n1307    C\n1308    S\nName: embarked, Length: 1309, dtype: object'

In [0]:
x = re.sub("\s+", " ", x)
x

'0 S 1 S 2 S 3 S 4 S 5 S 6 S 7 S 8 S 9 C 10 C 11 C 12 C 13 S 14 S 15 S 16 C 17 C 18 C 19 C 20 S 21 S 22 C 23 C 24 S 25 C 26 C 27 C 28 S 29 S .. 1279 S 1280 S 1281 S 1282 S 1283 S 1284 S 1285 S 1286 C 1287 S 1288 S 1289 S 1290 S 1291 S 1292 S 1293 S 1294 S 1295 S 1296 S 1297 S 1298 S 1299 C 1300 C 1301 C 1302 C 1303 C 1304 C 1305 C 1306 C 1307 C 1308 S Name: embarked, Length: 1309, dtype: object'

In [0]:
re.findall("[A-Z]", x)[0:10]

['S', 'S', 'S', 'S', 'S', 'S', 'S', 'S', 'S', 'C']

In [0]:
titan["embarked"].unique()

array(['S', 'C', nan, 'Q'], dtype=object)

In [0]:
np.unique(str(titan["embarked"]))

array(['0       S\n1       S\n2       S\n3       S\n4       S\n5       S\n6       S\n7       S\n8       S\n9       C\n10      C\n11      C\n12      C\n13      S\n14      S\n15      S\n16      C\n17      C\n18      C\n19      C\n20      S\n21      S\n22      C\n23      C\n24      S\n25      C\n26      C\n27      C\n28      S\n29      S\n       ..\n1279    S\n1280    S\n1281    S\n1282    S\n1283    S\n1284    S\n1285    S\n1286    C\n1287    S\n1288    S\n1289    S\n1290    S\n1291    S\n1292    S\n1293    S\n1294    S\n1295    S\n1296    S\n1297    S\n1298    S\n1299    C\n1300    C\n1301    C\n1302    C\n1303    C\n1304    C\n1305    C\n1306    C\n1307    C\n1308    S\nName: embarked, Length: 1309, dtype: object'],
      dtype='<U653')

In [0]:
titan["embarked"].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

In [0]:
titan["survived"][titan["embarked"] == "Q"].value_counts()

0.0    79
1.0    44
Name: survived, dtype: int64

In [0]:
titan["pclass"][titan["embarked"] == "Q"].value_counts()

3.0    113
2.0      7
1.0      3
Name: pclass, dtype: int64

In [0]:
titan["survived"][titan["embarked"] == "C"].value_counts()

1.0    150
0.0    120
Name: survived, dtype: int64

In [0]:
titan["pclass"][titan["embarked"] == "C"].value_counts()

1.0    141
3.0    101
2.0     28
Name: pclass, dtype: int64

In [0]:
titan["survived"][titan["embarked"] == "S"].value_counts()

0.0    610
1.0    304
Name: survived, dtype: int64

In [0]:
titan["pclass"][titan["embarked"] == "S"].value_counts()

3.0    495
2.0    242
1.0    177
Name: pclass, dtype: int64

In [0]:
# let's see the ratio of people who died vs survived

In [0]:
titan["survived"].value_counts()

0.0    809
1.0    500
Name: survived, dtype: int64

In [0]:
titan["survived"].value_counts()/titan["survived"].count()*100

0.0    61.802903
1.0    38.197097
Name: survived, dtype: float64

In [0]:
titan["sex"].value_counts()

male      843
female    466
Name: sex, dtype: int64

In [0]:
titan["pclass"].value_counts()

3.0    709
1.0    323
2.0    277
Name: pclass, dtype: int64

In [0]:
titan["age"].value_counts()

24.0000    47
22.0000    43
21.0000    41
30.0000    40
18.0000    39
25.0000    34
28.0000    32
36.0000    31
27.0000    30
29.0000    30
26.0000    30
19.0000    29
23.0000    26
32.0000    24
20.0000    23
35.0000    23
31.0000    23
45.0000    21
33.0000    21
17.0000    20
39.0000    20
16.0000    19
40.0000    18
42.0000    18
34.0000    16
50.0000    15
47.0000    14
48.0000    14
38.0000    14
2.0000     12
           ..
28.5000     3
18.5000     3
12.0000     3
71.0000     2
45.5000     2
36.5000     2
34.5000     2
14.5000     2
0.9167      2
30.5000     2
70.0000     2
55.5000     1
20.5000     1
0.4167      1
60.5000     1
23.5000     1
22.5000     1
38.5000     1
66.0000     1
24.5000     1
74.0000     1
0.1667      1
0.3333      1
80.0000     1
11.5000     1
26.5000     1
67.0000     1
70.5000     1
76.0000     1
0.6667      1
Name: age, Length: 98, dtype: int64

In [0]:
pd.pivot_table(titan, "survived", "pclass")

        survived
pclass
1.0     0.619195
2.0     0.429603
3.0     0.255289

In [0]:
pd.pivot_table(titan, "age", "survived", "pclass")

pclass          1.0        2.0        3.0
survived
0.0       43.247573  33.167808  25.974549
1.0       36.833794  24.858696  21.545166

In [0]:
pd.pivot_table(titan, "age", "survived", "pclass", aggfunc = "count")

pclass    1.0  2.0  3.0
survived
0.0       103  146  370
1.0       181  115  131

In [0]:
pd.pivot_table(titan, "sex", "survived", "pclass", aggfunc = "count")

pclass    1.0  2.0  3.0
survived
0.0       123  158  528
1.0       200  119  181

In [0]:
pd.pivot_table(titan, columns = "sex", values = "survived", index = ["pclass"], aggfunc = "count")

sex     female  male
pclass
1.0        144   179
2.0        106   171
3.0        216   493

In [0]:
pd.pivot_table(titan, columns = "sex", values = "survived", index = ["pclass"], aggfunc = "mean")

sex       female      male
pclass
1.0     0.965278  0.340782
2.0     0.886792  0.146199
3.0     0.490741  0.152130

In [0]:
pd.crosstab(titan["pclass"], titan["sex"])

sex     female  male
pclass
1.0        144   179
2.0        106   171
3.0        216   493

In [0]:
pd.crosstab(titan["survived"], titan["sex"])

sex       female  male
survived
0.0          127   682
1.0          339   161

In [0]:
pd.crosstab(titan["survived"], titan["age"])

age,0.1667,0.3333,0.4167,0.6667,0.75,0.8333,0.9167,1.0,2.0,3.0,...,64.0,65.0,66.0,67.0,70.0,70.5,71.0,74.0,76.0,80.0
survived,,,,,,,,,,,,,,,,,,,,,
0.0,0,1,0,0,1,0,0,3,8,2,...,3,3,1,1,2,1,2,1,0,0
1.0,1,0,1,1,2,3,2,7,4,5,...,2,0,0,0,0,0,0,0,1,1

In [0]:
x = pd.cut(titan["age"], [0, 5, 15, 25, 40, 55, 90], ['child', 'youngster', 'adult', 'mature', 'superm', 'old'])
x.value_counts()

(25, 40]    376
(15, 25]    328
(40, 55]    168
(55, 90]     59
(5, 15]      59
(0, 5]       56
Name: age, dtype: int64

In [0]:
# let's fill NaN's in embarked with 'C'

In [0]:
titan[titan["embarked"].isnull() == True]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
168,1.0,1.0,"Icard, Miss. Amelie",female,38.0,0.0,0.0,113572,80.0,NaN
284,1.0,1.0,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0.0,0.0,113572,80.0,NaN

In [0]:
titan["embarked"][titan["embarked"].isnull() == True] = "C"

In [0]:
titan.isnull().sum()

pclass        0
survived      0
name          0
sex           0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      0
dtype: int64

In [0]:
titan["fare"].head()

0    211.3375
1    151.5500
2    151.5500
3    151.5500
4    151.5500
Name: fare, dtype: float64

In [0]:
titan[titan["fare"].isnull() == True]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
1225,3.0,0.0,"Storey, Mr. Thomas",male,60.5,0.0,0.0,3701,NaN,S

In [0]:
titan["fare"].mean()

33.29547928134572

In [0]:
pd.crosstab(titan["pclass"], titan["fare"])

fare,0.0,3.1708,4.0125,5.0,6.2375,6.4375,6.45,6.4958,6.75,6.8583,...,153.4625,164.8667,211.3375,211.5,221.7792,227.525,247.5208,262.375,263.0,512.3292
pclass,,,,,,,,,,,,,,,,,,,,,
1.0,7,0,0,1,0,0,0,0,0,0,...,3,4,4,5,4,5,3,7,6,4
2.0,6,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3.0,4,1,1,0,1,3,1,3,2,1,...,0,0,0,0,0,0,0,0,0,0

class/package
--functions
--methods
--attributes

In [0]:
titan["fare"][np.logical_and(titan["pclass"] == 3.0, titan["survived"] == 0.0)].mean()

13.435451423149923

In [0]:
titan[np.logical_and(titan["pclass"] == 3.0, titan["survived"] == 0.0)][np.logical_and(titan["sex"] == "male", titan["age"] > 50.0)]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
727,3.0,0.0,"Connors, Mr. Patrick",male,70.5,0.0,0.0,370369,7.7500,Q
736,3.0,0.0,"Coxon, Mr. Daniel",male,59.0,0.0,0.0,364500,7.2500,S
782,3.0,0.0,"Duane, Mr. Frank",male,65.0,0.0,0.0,336439,7.7500,Q
833,3.0,0.0,"Green, Mr. George Henry",male,51.0,0.0,0.0,21440,8.0500,S
979,3.0,0.0,"Lundahl, Mr. Johan Svensson",male,51.0,0.0,0.0,347743,7.0542,S
1015,3.0,0.0,"Meo, Mr. Alfonzo",male,55.5,0.0,0.0,A.5. 11206,8.0500,S
1068,3.0,0.0,"Nysveen, Mr. Johan Hansen",male,61.0,0.0,0.0,345364,6.2375,S
1225,3.0,0.0,"Storey, Mr. Thomas",male,60.5,0.0,0.0,3701,NaN,S
1235,3.0,0.0,"Svensson, Mr. Johan",male,74.0,0.0,0.0,347060,7.7750,S
1287,3.0,0.0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0.0,0.0,347064,7.7500,S

In [0]:
titan["fare"][np.logical_and(titan["pclass"] == 3.0, titan["survived"] == 0.0)][np.logical_and(titan["sex"] == "male", titan["age"] > 50.0)].mean()

7.518522222222221

In [0]:
# titan["fare"][titan["fare"].isnull() == True] = 7.518522222222221
# or
titan["fare"] = titan["fare"].fillna(7.518522222222221)

In [0]:
titan.isnull().sum()

pclass        0
survived      0
name          0
sex           0
age         263
sibsp         0
parch         0
ticket        0
fare          0
embarked      0
dtype: int64

In [0]:
titan = titan.drop("ticket", axis = 1)

In [0]:
# looking at NaN's in age

In [0]:
titan["age"].isnull().sum()/titan["age"].count()*100

25.1434034416826

In [0]:
titan["age"].mean()

29.8811345124283

In [0]:
titan["age"].median()

28.0

In [0]:
titan["fare"][titan["age"].isnull() == True].mean()

19.823319391635003

In [0]:
for i in ["pclass", "survived", "sex", "embarked", "sibsp", "parch"]:
  print(titan[i][titan["age"].isnull() == True].value_counts())

3.0    208
1.0     39
2.0     16
Name: pclass, dtype: int64
0.0    190
1.0     73
Name: survived, dtype: int64
male      185
female     78
Name: sex, dtype: int64
S    132
Q     73
C     58
Name: embarked, dtype: int64
0.0    206
1.0     39
8.0      8
2.0      6
3.0      4
Name: sibsp, dtype: int64
0.0    234
2.0     16
1.0     10
9.0      2
4.0      1
Name: parch, dtype: int64

In [0]:
def myfunc():
  titan[titan["age"].isnull() == True]

In [0]:
titan[titan["age"].isnull() == True].corr()

            pclass  survived  age     sibsp     parch      fare
pclass    1.000000 -0.186210  NaN  0.121063  0.115397 -0.465775
survived -0.186210  1.000000  NaN -0.077828 -0.078489  0.135391
age            NaN       NaN  NaN       NaN       NaN       NaN
sibsp     0.121063 -0.077828  NaN  1.000000  0.388618  0.356431
parch     0.115397 -0.078489  NaN  0.388618  1.000000  0.255690
fare     -0.465775  0.135391  NaN  0.356431  0.255690  1.000000

In [0]:
titan.corr()

            pclass  survived       age     sibsp     parch      fare
pclass    1.000000 -0.312469 -0.408106  0.060832  0.018322 -0.558745
survived -0.312469  1.000000 -0.055513 -0.027825  0.082660  0.244484
age      -0.408106 -0.055513  1.000000 -0.243699 -0.150917  0.177265
sibsp     0.060832 -0.027825 -0.243699  1.000000  0.373587  0.160391
parch     0.018322  0.082660 -0.150917  0.373587  1.000000  0.221670
fare     -0.558745  0.244484  0.177265  0.160391  0.221670  1.000000